test_cases/airFoil2D_Re3e6_alpha0_datadriven/system/FOforces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    timeStep;
    writeInterval   1;
    log false;

    patches
    (
        airfoil
    );

    CofR        (0 0 0);
    liftDir     (0 1 0);
    dragDir     (1 0 0);
    pitchAxis   (0 0 1);
    rho         rhoInf;
    rhoInf      1.0;
    magUInf     30.0;
    lRef        1.0;
    Aref        0.2;
}

// ************************************************************************* //
